{
    "title": {
        "locales": {
            "en": {
                "title_short": "Life recently",
                "title_short_nav": "Updates",
                "title_long_prefix": "Take a look at my",
                "title_long": "Recent {{Updates}}"
            },
            "es": {
                "title_short": "Vida Reciente",
                "title_short_nav": "Actualizaciones",
                "title_long_prefix": "Consulta mis",
                "title_long": "Actualizaciones {{Recientes}}"
            },
            "fr": {
                "title_short": "Vie Récente",
                "title_short_nav": "Mises à Jour",
                "title_long_prefix": "Découvrez mes",
                "title_long": "Dernières {{Mises à Jour}}"
            },
            "ko": {
                "title_short": "최근의 삶",
                "title_short_nav": "업데이트",
                "title_long_prefix": "내 최근",
                "title_long": "{{업데이트}}를 확인해 보세요"
            }
        }
    },

    "articles": [
        {
            "id": 1,
            "component": "ArticleFacts",
            "locales": {},
            "settings": {
                "order_items_by": "id",
                "order_items_sort": "asc"
            },
            "items": [
                {
                    "id": 1,
                    "img": null,
                    "faIcon": "fa-solid fa-tablet-screen-button",
                    "faIconColors": {"bg": "", "fill": ""},
                    "locales": {
                        "en": {
                            "title": "03",
                            "text": "Apps Published"
                        },
                        "es": {
                            "text": "Aplicaciones Publicadas"
                        },
                        "fr": {
                            "text": "Applications Publiées"
                        },
                        "ko": {
                            "text": "출시된 앱"
                        }
                    }
                },
                {
                    "id": 2,
                    "img": null,
                    "faIcon": "fa-solid fa-star",
                    "faIconColors": {"bg": "", "fill": ""},
                    "locales": {
                        "en": {
                            "title": "100+",
                            "text": "Stars on GitHub"
                        },
                        "es": {
                            "text": "Estrellas en GitHub"
                        },
                        "fr": {
                            "text": "Étoiles sur GitHub"
                        },
                        "ko": {
                            "text": "GitHub의 별"
                        }
                    }
                },
                {
                    "id": 3,
                    "img": null,
                    "faIcon": "fa-solid fa-globe",
                    "faIconColors": {"bg": "", "fill": ""},
                    "locales": {
                        "en": {
                            "title": "3",
                            "text": "Countries visited"
                        },
                        "es": {
                            "text": "Países Visitados"
                        },
                        "fr": {
                            "text": "Pays Visités"
                        },
                        "ko": {
                            "text": "방문한 국가"
                        }
                    }
                },
                {
                    "id": 4,
                    "img": null,
                    "faIcon": "fa-solid fa-diagram-project",
                    "faIconColors": {"bg": "", "fill": ""},
                    "locales": {
                        "en": {
                            "title": "4",
                            "text": "Open-source projects"
                        },
                        "es": {
                            "text": "Proyectos de Código Abierto"
                        },
                        "fr": {
                            "text": "Projets Open-source"
                        },
                        "ko": {
                            "text": "오픈 소스 프로젝트"
                        }
                    }
                },
                {
                    "id": 5,
                    "img": null,
                    "faIcon": "fa-solid fa-coffee",
                    "faIconColors": {"bg": "", "fill": ""},
                    "locales": {
                        "en": {
                            "title": "20,000",
                            "text": "Coffees consumed"
                        },
                        "es": {
                            "text": "Cafés Consumidos"
                        },
                        "fr": {
                            "text": "Cafés Consommés"
                        },
                        "ko": {
                            "text": "소비된 커피"
                        }
                    }
                },
                {
                    "id": 6,
                    "img": null,
                    "faIcon": "fa-solid fa-laptop-code",
                    "faIconColors": {"bg": "", "fill": ""},
                    "locales": {
                        "en": {
                            "title": "1,000,000+",
                            "text": "Lines of code"
                        },
                        "es": {
                            "text": "Líneas de código"
                        },
                        "fr": {
                            "text": "Lignes de code"
                        },
                        "ko": {
                            "text": "코드 라인 수"
                        }
                    }
                },
                {
                    "id": 7,
                    "img": null,
                    "faIcon": "fa-solid fa-heart",
                    "faIconColors": {"bg": "", "fill": ""},
                    "locales": {
                        "en": {
                            "title": "Infinite",
                            "text": "Passion for learning"
                        },
                        "es": {
                            "title": "Infinita",
                            "text": "Pasión por Aprender"
                        },
                        "fr": {
                            "title": "Infinie",
                            "text": "Passion d'apprendre"
                        },
                        "ko": {
                            "title": "무한대",
                            "text": "배움에 대한 열정"
                        }
                    }
                }
            ]
        },

        {
            "id": 2,
            "component": "ArticleThread",
            "locales": {
                "en": { "title": "Quick {{Facts}}" },
                "es": { "title": "Feed de {{Noticias}}" },
                "fr": { "title": "Fil d'{{Actualités}}" },
                "ko": { "title": "{{뉴스}} 피드" }
            },
            "settings": {
                "max_rows_collapse_threshold": 3,
                "order_items_by": "dateStart",
                "order_items_sort": "desc"
            },
            "items": [
                {
                    "id": 1,
                    "date": {"year": 2023, "month": 9},
                    "preview": {
                        "links": [],
                        "screenshots": [],
                        "screenshotsAspectRatio": "",
                        "youtubeVideo": ""
                    },
                    "locales": {
                        "en": {
                            "title": "Trip to {{Portugal!}}",
                            "province": "Porto",
                            "country": "Spain",
                            "institution": "",
                            "text": "For five days, I had the opportunity to enjoy a vacation in Porto, Portugal, a city that combines history, beauty, and authenticity. I strolled through its cobbled streets, discovered the charm of the old town, and took in the breathtaking views from the Dom Luís I Bridge. <br><br>I tried its delicious cuisine, with typical dishes like grilled cod and francesinha, not to mention the famous pastéis de nata. I also walked along the Douro River, visited traditional wineries, and let myself be carried away by the unique atmosphere this city offers. <br><br>I found Porto to be a perfect destination to disconnect, soak up some culture, and return with new ideas and inspiration. Without a doubt, it's a trip I will remember with great fondness."
                        },
                        "es": {
                            "title": "Viaje a {{Portugal!}}",
                            "province": "Oporto",
                            "country": "España",
                            "institution": "",
                            "text": "Durante cinco días, tuve la oportunidad de disfrutar de unas vacaciones en Oporto, Portugal, una ciudad que combina historia, belleza y autenticidad. Paseé por sus calles empedradas, descubrí el encanto del casco antiguo y contemplé las impresionantes vistas desde el Puente Don Luis I. <br><br>Probé su deliciosa gastronomía, con platos típicos como el bacalao a la brasa y la francesinha, sin olvidar los famosos pasteles de nata. También recorrí la ribera del Duero, visité bodegas tradicionales y me dejé llevar por la atmósfera única que ofrece esta ciudad.<br><br> Oporto me pareció un destino perfecto para desconectar, empaparme de cultura y volver con nuevas ideas e inspiración. Sin duda, un viaje que recordaré con especial cariño."
                        },
                        "fr": {
                            "title": "Voyage à {{Portugal!}}",
                            "province": "Porto",
                            "country": "Espagne",
                            "institution": "",
                            "text": "Pendant cinq jours, j'ai eu l'opportunité de profiter de vacances à Porto, au Portugal, une ville qui allie histoire, beauté et authenticité. J'ai flâné dans ses rues pavées, découvert le charme de la vieille ville et contemplé les vues impressionnantes depuis le Pont Dom Luís I. <br><br>J'ai goûté à sa délicieuse gastronomie, avec des plats typiques comme le 'bacalao a la brasa' et la 'francesinha', sans oublier les célèbres 'pastéis de nata'. J'ai également parcouru les rives du Douro, visité des caves à vin traditionnelles et me suis laissé porter par l'atmosphère unique qu'offre cette ville. <br><br>Porto m'a semblé être une destination parfaite pour déconnecter, m'imprégner de culture et revenir avec de nouvelles idées et de l'inspiration. Sans aucun doute, un voyage dont je me souviendrai avec une affection particulière."
                        },
                        "ko": {
                            "title": "{{포르투갈}} 여행!",
                            "province": "포르투",
                            "country": "스페인",
                            "institution": "",
                            "text": "5일 동안 저는 역사, 아름다움, 진정성이 조화를 이루는 도시인 포르투갈의 포르투에서 휴가를 즐길 기회가 있었습니다. 저는 조약돌이 깔린 거리를 거닐고, 구시가지의 매력을 발견하고, 루이스 1세 다리에서 숨 막히는 경치를 감상했습니다. <br><br>저는 유명한 '파스텔 드 나타(pastéis de nata)'는 물론, 구운 대구와 '프란세지냐(francesinha)' 같은 전형적인 요리를 포함한 맛있는 현지 음식을 맛보았습니다. 또한 도루 강변을 따라 걸으며, 전통 와이너리를 방문하고 이 도시가 제공하는 독특한 분위기에 흠뻑 빠져들었습니다. <br><br>포르투는 일상에서 벗어나 문화에 흠뻑 젖고 새로운 아이디어와 영감을 얻어 돌아오기에 완벽한 목적지라고 생각했습니다. 의심할 여지 없이, 특별한 애정을 가지고 기억할 여행입니다."
                        }
                    }
                },
                
                {
                    "id": 3,
                    "date": {"year": 2025, "month": 7},
                    "preview": {
                        "links": [
                            {"href": "https://la-velada-5.vercel.app/", "tooltipString": "open_website", "faIcon": "fa-brands fa-medium"},
                            {"href": "https://github.com/Visualmikblood/la_velada_5", "tooltipString": "see_on_github", "faIcon": "fa-brands fa-github"}
                        ],
                        "screenshots": [
                            "images/pictures/iconos_seccion_portfolio_enlaces_de_los_proyectos/velada_5/velada_5.png"
                        ],
                        "screenshotsAspectRatio": "",
                        "youtubeVideo": ""
                    },
                    "locales": {
                        "en": {
                            "title": "Working on web recreation {{La velada 5}}",
                            "province": "Tomelloso",
                            "country": "Spain",
                            "institution": "La velada del año",
                            "text": "New web recreation! <b>(Project in progress)</b> I have developed a new version of the 'La Velada del Año 5' website, inspired by the visual style and structure of the original event. This recreation aims to capture the essence of the show, integrating sections such as fights, participants, and ticket sales, all with a responsive design and smooth navigation. <br> <br> An ideal project to continue perfecting my skills in web layout and design, combining visual fidelity and interactivity.! Some features of this project include:",
                            "list": [
                                "Design inspired by the event's official site", 
                                "Responsive layout for all devices", 
                                "Modern and appealing visual aesthetic, based on the La Velada branding", 
                                "Use of HTML, CSS, JavaScript, and React"
                            ]
                        },
                        "es": {
                            "title": "Trabajando en recreación web {{La velada 5}}",
                            "province": "Tomelloso",
                            "country": "España",
                            "institution": "La velada del año",
                            "text": "Nueva recreación web! <b>(Proyecto en proceso)</b> He desarrollado una nueva versión de la web de La Velada del Año 5, inspirada en el estilo visual y estructura del evento original. Esta recreación busca capturar la esencia del espectáculo, integrando secciones como los combates, participantes y venta de entradas, todo con un diseño responsive y una navegación fluida. <br> <br> Un proyecto ideal para seguir perfeccionando mis habilidades en maquetación y diseño web, combinando fidelidad visual e interactividad.! Algunas características de este proyecto incluyen:",
                            "list": [
                                "Diseño inspirado en el sitio oficial del evento",
                                "Maquetación responsive para todos los dispositivos",
                                "Estética visual moderna y atractiva, basada en el branding de La Velada",
                                "Uso de HTML, CSS y JavaScript y React"
                            ]
                        },
                        "fr": {
                            "title": "Travail sur la recréation du site web {{La velada 5}}",
                            "province": "Tomelloso",
                            "country": "Espagne",
                            "institution": "La velada del año",
                            "text": "Nouvelle recréation de site web! <b>(Projet en cours)</b> J'ai développé une nouvelle version du site web de 'La Velada del Año 5', inspirée du style visuel et de la structure de l'événement original. Cette recréation vise à capturer l'essence du spectacle, en intégrant des sections telles que les combats, les participants et la vente de billets, le tout avec un design responsive et une navigation fluide. <br> <br> Un projet idéal pour continuer à perfectionner mes compétences en mise en page et en conception de sites web, alliant fidélité visuelle et interactivité.! Certaines caractéristiques de ce projet incluent :",
                            "list": [
                                "Design inspiré du site officiel de l'événement", 
                                "Mise en page responsive pour tous les appareils", 
                                "Esthétique visuelle moderne et attrayante, basée sur le branding de La Velada", 
                                "Utilisation de HTML, CSS, JavaScript et React"
                            ]
                        },
                        "ko": {
                            "title": "{{라 벨라다 5}} 웹사이트 재구성 작업 중",
                            "province": "토멜로소",
                            "country": "스페인",
                            "institution": "라 벨라다 델 아뇨",
                            "text": "새로운 웹사이트 재구성! <b>(진행 중인 프로젝트)</b> 원본 이벤트의 시각적 스타일과 구조에서 영감을 받아 '라 벨라다 델 아뇨 5' 웹사이트의 새로운 버전을 개발했습니다. 이 재구성은 시합, 참가자, 티켓 판매와 같은 섹션을 통합하고 반응형 디자인과 유연한 탐색 기능을 통해 쇼의 본질을 포착하고자 합니다. <br> <br> 시각적 충실도와 상호작용성을 결합하여 웹 레이아웃 및 디자인 기술을 계속해서 완성하는 데 이상적인 프로젝트입니다.! 이 프로젝트의 일부 특징은 다음과 같습니다:",
                            "list": [
                                "이벤트 공식 사이트에서 영감을 받은 디자인", 
                                "모든 기기에 대한 반응형 레이아웃", 
                                "라 벨라다 브랜딩을 기반으로 한 현대적이고 매력적인 시각적 미학", 
                                "HTML, CSS, JavaScript 및 React 사용"
                            ]
                        }
                    }
                },
                {
                    "id": 4,
                    "date": {"year": 2025, "month": 3},
                    "preview": {
                        "links": [],
                        "screenshots": [],
                        "screenshotsAspectRatio": "",
                        "youtubeVideo": ""
                    },
                    "locales": {
                        "en": {
                            "title": "Attending the {{Digital Kit Digitalization Forum Conference!}}",
                            "province": "Ciudad Real",
                            "country": "Spain",
                            "institution": "Chamber of Commerce of Ciudad Real.",
                            "text": "I had the pleasure of attending the Digital Kit Digitalization Forum in Ciudad Real! It was an enriching experience that addressed key topics on digital transformation and artificial intelligence applied to businesses. One of the highlights was the participation of the renowned expert Chema Alonso, along with other professionals from the sector. <br><br> This event allowed me to get a close look at the latest technological trends, connect with other innovation enthusiasts, and continue expanding my vision of the digital future. An inspiring day that undoubtedly adds value to my growth as a developer!"
                        },
                        "es": {
                            "title": "Asistiendo a la {{Conferencia de  Foro Digitalización Kit Digital!}}",
                            "province": "Ciudad Real",
                            "country": "España",
                            "institution": "Cámara de comercio Ciudad Real.",
                            "text": "¡Tuve el placer de asistir al Foro Digitalización Kit Digital en Ciudad Real! Fue una experiencia enriquecedora en la que se abordaron temas clave sobre transformación digital e inteligencia artificial aplicada a empresas. Uno de los momentos más destacados fue la participación del reconocido experto Chema Alonso, junto a otros profesionales del sector. <br><br> Este evento me permitió conocer de cerca las últimas tendencias tecnológicas, conectar con otros entusiastas de la innovación y seguir ampliando mi visión sobre el futuro digital. ¡Una jornada inspiradora que sin duda aporta valor a mi crecimiento como desarrollador!"
                        },
                        "fr": {
                            "title": "Participation à la {{Conférence du Forum de numérisation Kit Digital!}}",
                            "province": "Ciudad Real",
                            "country": "Espagne",
                            "institution": "Chambre de commerce de Ciudad Real.",
                            "text": "J'ai eu le plaisir d'assister au Forum de numérisation Kit Digital à Ciudad Real ! Ce fut une expérience enrichissante où des sujets clés sur la transformation numérique et l'intelligence artificielle appliquée aux entreprises ont été abordés. L'un des moments forts a été la participation de l'expert renommé Chema Alonso, aux côtés d'autres professionnels du secteur. <br><br> Cet événement m'a permis de découvrir de près les dernières tendances technologiques, de me connecter avec d'autres passionnés d'innovation et de continuer à élargir ma vision de l'avenir numérique. Une journée inspirante qui ajoute sans aucun doute de la valeur à mon développement en tant que développeur !"
                        },
                        "ko": {
                            "title": "{{디지털화 키트 디지털화 포럼 컨퍼런스!}} 참석",
                            "province": "시우다드 레알",
                            "country": "스페인",
                            "institution": "시우다드 레알 상공회의소.",
                            "text": "시우다드 레알에서 열린 디지털화 키트 디지털화 포럼에 참석하게 되어 기뻤습니다! 기업에 적용되는 디지털 전환 및 인공 지능에 대한 핵심 주제를 다루는 유익한 경험이었습니다. 가장 하이라이트 중 하나는 유명 전문가 **체마 알론소(Chema Alonso)**와 업계의 다른 전문가들의 참여였습니다. <br><br> 이 행사를 통해 최신 기술 동향을 면밀히 파악하고, 다른 혁신 애호가들과 소통하며, 디지털 미래에 대한 제 시야를 넓힐 수 있었습니다. 개발자로서의 성장에 의심할 여지 없이 가치를 더하는 영감을 주는 하루였습니다!"
                        }
                    }
                }
                
            ]
        }
    ]
}